import { Prisma } from '@prisma/client'
// 辅助函数
function d(date: string | Date) {
    return new Date(date).toISOString()
}
const timeline: Prisma.TimelineCreateManyItemInput[] = [
    {
        "what": "后梁太祖朱温（852年12月5日～912年7月18日），开平元年（907年）到乾化二年（912年）在位",
    },
    {
        "what": "宋州砀山（今安徽省砀山县）人，后梁开国皇帝，唐僖宗赐名“朱全忠”，即位后改名朱晃   "
    },
    {
        "what": "乾符二年（875年），参加王仙芝、黄巢领导的农民起义军，先后攻陷洛阳、长安等地，大大动摇了唐王朝的统治地位"
    },
    {
        "what": "中和二年（882年），归附唐军王重荣、杨复光部，与李克用等联合镇压黄巢军"
    },
    {
        "what": "因镇压黄巢军有功，被唐僖宗赐名“全忠”，任河南中行营招讨副使"
    },
    {
        "what": "次年拜汴州刺史出宣武军节度使，继而又进封梁王"
    },
    {
        "what": "他以河南为中心，极力扩大势力，逐渐成了唐末最大的割据势力"
    },
    {
        "what": "唐昭宗天复元年（901年），朱温率军进入关中，控制了唐王朝的中央政权"
    },
    {
        "what": "天祐元年（904年），用武力把唐昭宗逼迁洛阳，不久将昭宗杀死"
    },
    {
        "what": "立昭宗儿子李柷为帝，即唐哀帝（又称昭宣帝）"
    },
    {
        "what": "天祐四年（907年），朱温通过禅让的形式夺取了唐哀帝的帝位，代唐称帝，建国号梁，改年号为开平，史称“后梁”"
    },
    {
        "what": "乾化二年（912年），朱温因继立问题，被亲子朱友珪弑杀"
    },
    {
        "what": "朱温在位六年，享年六十一岁，上谥号神武元圣孝皇帝，庙号太祖"
    },
    {
        "what": "同年十一月下葬宣陵"
    },
].map((c) => ({ start: '', end: '', ...c }));

const timeline1 = [
    {
        "what": "唐宣宗大中六年十月二十一日（852年12月5日）夜，朱温出生在宋州砀山县午沟里，他的父亲和祖父是学者和教师，但从未当过官。朱温父亲朱诚是个私塾教师，通达《五经》并讲授之，人称“朱五经”。当时教师的地位比较高，以致能和本地一个更有名望的地方官员家族通婚。家中有三子，长兄朱全昱，二兄朱存，朱温排行三。",
        "start": "0852-12-05"
    },
    {
        "what": "由于父亲早死，家贫，其母王氏就带着他们兄弟佣食于萧县刘崇家",
        "start": "0859-01-01"
    },
    {
        "what": "朱温长大成人后，不从事生产，以豪雄英勇自许，乡里人多数对他很反感，刘崇同样不喜欢他，只有刘崇的母亲善待他",
        "start": "0870-01-01"
    },
    {
        "what": "乾符四年（877年），朱温与二兄朱存辞别刘崇家，一起投入黄巢军中",
        "start": "0877-01-01"
    },
    {
        "what": "黄巢军转战岭南时，朱存战死，朱温则因功补为队长",
        "start": "0877-01-01"
    },
    {
        "what": "  广明元年（880年）十二月五日，黄巢起义军攻陷唐都长安，唐僖宗逃往成都",
        "start": "0880-01-01"
    },
    {
        "what": "黄巢派遣朱温领兵驻扎在东渭桥",
        "start": "0880-01-01"
    },
    {
        "what": "这时，唐将诸葛爽率领工北行营的兵马驻扎在栎阳（今陕西省西安市阎良区武屯镇），黄巢派朱温去招安诸葛爽，诸葛爽被朱温说服，归降黄巢",
        "start": "0880-01-01"
    },
    {
        "what": "中和元年（881年）二月，朱温被任为东南面行营都虞候，受命攻占邓州（今河南省邓州市），俘虏刺史赵戒，阻扼了由荆襄地区北攻的唐军，稳定了新建的“大齐”政权东南面的局势",
        "start": "0881-01-01"
    },
    {
        "what": "六月，朱温返回长安时，黄巢亲自到灞上劳军",
        "start": "0881-01-01"
    },
    {
        "what": "七月，又把朱温调到长安西面的兴平（今陕西咸阳兴平），抗击从邠（今彬县）、岐（今凤翔县南）、鄜（今富县）、夏（今靖边县北）等州调集的唐军",
        "start": "0881-01-01"
    },
    {
        "what": "八月，鄜延节度使李孝昌、夏州节度使李思恭驻扎在东渭桥（位于今陕西省西安市高陵区），黄巢派朱温前去抵御",
        "start": "0881-01-01"
    },
    {
        "what": "九月，朱温在东渭桥一带大败唐将李思恭、李孝昌等军",
        "start": "0881-01-01"
    },
    {
        "what": "十一月，孟楷、朱温乘胜在富平大破鄜州李孝昌、夏州李思恭的兵马，二李溃不成军，逃回了原来的藩镇",
        "start": "0881-01-01"
    },
    {
        "what": "中和二年（882年）二月，黄巢任命朱温为同州（今陕西省渭南市大荔县）防御使，让朱温自行攻取",
        "start": "0882-01-01"
    },
    {
        "what": "朱温从丹州（今陕西宜川）领兵南下，很快攻克同州，同州刺史米诚逃奔河中",
        "start": "0882-01-01"
    },
    {
        "what": "当时河中节度使王重荣屯扎了数万军队，纠合其他藩镇，计划收复同州",
        "start": "0882-01-01"
    },
    {
        "what": "朱温与王重荣在河中交战，   王重荣挑选精锐甲士三万人攻打朱温，朱温大惧，将舟船全部凿沉在河中",
        "start": "0882-01-01"
    },
    {
        "what": "朱温被王重荣击败后向黄巢请求支援，进上十次表章，均被黄巢的左军使孟楷隐报",
        "start": "0882-01-01"
    },
    {
        "what": "又听说黄巢军队势力窘迫困厄，将帅大多军心涣散，他的亲信将领胡真、谢瞳劝他反正降唐，朱温推知黄巢起义军必将失败，于是有投降唐朝的准备",
        "start": "0882-01-01"
    },
    {
        "what": "中和二年（882年）九月，朱温同身旁心腹计议，杀了黄巢的监军使严实，率领全同州军民投降王重荣",
        "start": "0882-09-01"
    },
    {
        "what": "杨复光想要斩杀朱温，王重荣阻止说：“如今招降黄巢兵马，投降的一律赦免，况且朱温此人骁勇可用，杀了他怕是不祥”",
        "start": "0882-09-01"
    },
    {
        "what": "朱温认王重荣为舅父，王铎遵守诏令以朱温为同华节度使",
        "start": "0882-09-01"
    },
    {
        "what": "王重荣当天就赶快写成奏章上报朝廷",
        "start": "0882-09-01"
    },
    {
        "what": "唐僖宗在蜀郡看到奏章就高兴地说：“这是上天赐给我的上将啊”",
        "start": "0882-09-01"
    },
    {
        "what": "下诏授给朱温左金吾卫大将军的官职，担任河中行营副招讨使，又赐名“全忠”",
        "start": "0882-09-01"
    },
    {
        "what": "从此朱温统率他的旧部以及河中的兵士一起行动，所到之处战无不克",
        "start": "0882-09-01"
    },
    {
        "what": "中和三年（883年）二月，唐朝廷任朱温为汴州刺史、宣武军节度使，要等到唐军收复京城后赴任",
        "start": "0882-09-01"
    },
    {
        "what": "   于是朱温加紧与各路唐军围攻长安"
    },
    {
        "what": "四月，黄巢退出长安，由蓝田关（今蓝田境）东出，   攻入蔡州（今河南省汝南县），唐蔡州节度使秦宗权投降，于是进围陈州（今河南省淮阳县）"
    },
    {
        "what": "主词条：唐灭大齐之战、黄巢陈州之战、上源驿事件中和三年（883年）七月，朱温进入汴州上任节度使，朱温这时三十二岁"
    },
    {
        "what": "从此，汴州（宣武军）成为他的大本营"
    },
    {
        "what": "当时汴、宋等地饥民遍野，官民所用物资都穷尽，内外兵马骄横难以压制，面临着内外危机，而朱温的兵势却日益增加"
    },
    {
        "what": "当时蔡州刺史秦宗权同黄巢余党纠合，一同包围陈州"
    },
    {
        "what": "唐僖宗下诏书，因为黄巢未平，加朱温为东北面都招讨使，去支援陈州"
    },
    {
        "what": "   后梁太祖朱温像"
    },
    {
        "what": "中和四年（884年）春天，当时黄巢的兵势还非常强，周岌、时溥、朱温等难以独自抵挡，一起求救于河东节度使李克用"
    },
    {
        "what": "   朱温在瓦子寨袭击黄巢的部队，攻下了瓦子寨；黄巢的大将李唐宾、楚丘王虔裕投降了朱温"
    },
    {
        "what": "   当时，陈州四面有很多黄巢残余的部队，朱温分兵扑灭包围陈州的黄巢军队，经历大小四十次战斗"
    },
    {
        "what": "四月，朱温军队攻下西华寨，黄巢大将黄思邺只剩下一人骑马逃奔陈州"
    },
    {
        "what": "朱温乘胜追击，鼓噪而进"
    },
    {
        "what": "黄巢的军队退走， 朱温攻入陈州"
    },
    {
        "what": "   因为陈州刺史赵犨很感激朱温，到他马前迎接，继而归附于他"
    },
    {
        "what": "   不久听说黄巢余党还在陈州北面的故阳垒，朱温就直接回到汴州"
    },
    {
        "what": "这时河东节度使李克用奉唐僖宗诏令，统率骑兵数千人马共同图谋消灭黄巢，与朱温会合在中牟的北面的王满渡与黄巢的军队开战，等黄巢的军队渡河一半的时候袭击他，最后大败黄巢，杀死黄巢军一万多人，黄巢残部很快束手投降"
    },
    {
        "what": "大将霍存、葛从周、张归厚、张归霸等人也都跪倒在朱温的马前，朱温赦免了他们的罪行并收容了他们"
    },
    {
        "what": "   中和四年（884年）五月十四日，朱温和李克用的军队回到汴州，李克用被安置在上源驿客馆里"
    },
    {
        "what": "接着朱温大摆宴席犒劳他，李克用乘酒醉大发脾气，惹怒了朱温"
    },
    {
        "what": "这天晚上，朱温命令士兵火攻李克用的住地"
    },
    {
        "what": "恰好碰上大雨，雷电交加，李克用趁着雷电光翻墙逃去，只杀死他的部下百余人"
    },
    {
        "what": "   李克用到达军中后，向唐僖宗诉讼此事，请求对朱温用兵，唐僖宗从中调和，加封李克用为陇西郡王来安抚他，没有治朱温的罪"
    },
    {
        "what": "中和四年（884年）六月，陈州百姓为感谢朱温解陈州之围，为朱温修建了生前受祭的祠堂"
    },
    {
        "what": "同年，黄巢兵败逃去狼虎谷（今山东莱芜西南）身死，蔡州秦宗权接替黄巢的位置"
    },
    {
        "what": "   秦宗权纵兵四出，侵犯周围的藩镇"
    },
    {
        "what": "朱温被秦宗权所攻，情势十分危急，朱温向天平节度使朱瑄，朱瑄派他的从弟朱瑾带兵去营救朱温，在合乡击败秦宗权"
    },
    {
        "what": "朱温十分感激朱瑄，与朱瑄结拜为兄弟"
    },
    {
        "what": "   九月二日，唐僖宗就地加封朱温为检校司徒、同平章事，封为沛郡侯，食邑一千户"
    },
    {
        "what": "  主词条：唐平秦宗权蔡州之战光启元年（885年）春天，秦宗权部抢夺亳州、颍州，朱温率领军队前去救助，到达焦夷，与秦宗权部交战，杀死敌军数千人，活捉敌将殷铁林，砍下他的头颅悬挂城门警示就返回了"
    },
    {
        "what": "三月，唐僖宗从蜀地回到长安，改元为光启"
    },
    {
        "what": "四月十四日，又加封朱温为检校太保，将食邑增加到一千五百户"
    },
    {
        "what": "十二月，河中、太原的敌军逼近长安，唐僖宗离开长安抵达凤翔"
    },
    {
        "what": "  光启二年（886年）春天，秦宗权部更加猖狂"
    },
    {
        "what": "当时唐朝皇室势力微弱，许多道和州的军队不听皇室的指挥，所以秦宗权得以横行为害，接连攻陷汝、洛、怀、孟、唐、邓、许、郑等州，方圆几千里，几乎断绝了人烟，只有宋、亳、滑、颍等州仅能闭关自守而已"
    },
    {
        "what": "朱温多次出兵与他们交战，但是有时胜利有时失败，百姓惶恐朱温战败，使他们遭到掠杀"
    },
    {
        "what": "   三月一日，唐僖宗颁布诏令封朱温为沛郡王"
    },
    {
        "what": "同时，滑州义成军节度使安师儒因部下叛乱而被推翻，牙将张骁自任为滑州留后"
    },
    {
        "what": "朱温于是遣朱珍、李唐宾征讨，随即攻取下滑州，任命胡真为滑州留后"
    },
    {
        "what": "   同月，唐僖宗御驾移到兴元府"
    },
    {
        "what": "十二月，唐僖宗颁布诏令加封朱温为检校太傅，改封为吴兴郡王，食邑三千户"
    },
    {
        "what": "  光启三年（887年）春二月一日，朱温按照诏命以朱珍为淄州刺史，派他到东道招募兵士"
    },
    {
        "what": "十天之内，应募的有一万多人"
    },
    {
        "what": "四月八日，回到汴州，朱温高兴地说：“我的大事可以成了"
    },
    {
        "what": "”这时，蔡州秦宗权的部将张日至屯扎在北郊，秦贤屯扎在版桥，各自都有几十万人，树起的栅栏相连二十里，军势非常强盛"
    },
    {
        "what": "朱温对诸位将领说：“他们正在养精蓄锐以等待时机，一定会来进攻我们"
    },
    {
        "what": "况且秦宗权估计我们兵力少，又不知道朱珍已经来到，以为我们害怕，只能坚守阵地而已"
    },
    {
        "what": "不如出其不意，先发制人"
    },
    {
        "what": "”于是亲自领兵进攻秦贤的营寨，将士们奋勇争先，秦贤果然没有防备，接连攻克四座营寨，杀死一万多人，当时人们都以为有天神在暗中相助"
    },
    {
        "what": "二十七日，秦宗权将领卢瑭带领一万多人在圃田北面的万胜戍沿汴水两岸扎营，跨河面建起桥梁，以控制河运道路"
    },
    {
        "what": "朱温挑选精兵锐卒去袭击他"
    },
    {
        "what": "这时正好下起了大雾，朱温部队到达卢军营垒的时候才被发现，于是闯入卢军军营掩杀，卢军投水而死的人非常多，卢瑭也投河自尽"
    },
    {
        "what": "秦宗权在河南的诸多部队接连战败，不敢再贸然进击"
    },
    {
        "what": "  五月三日，朱温从酸枣门出兵，从清晨到中午，与秦宗权军短兵相接，大败秦宗权，追杀二十多里，死尸堆积"
    },
    {
        "what": "秦宗权对这次的失败感到羞耻难当，因此更加暴虐，于是从郑州亲自带领几位将领突袭，径直奔入张晊军营中"
    },
    {
        "what": "五月八日，朱温在兖、郓、滑州的军队都赶来增援，在汴水岸边摆开阵势，大军武器精良，十分雄壮，旌旗蔽日，非常壮观"
    },
    {
        "what": "秦宗权看到朱温大军的军容，不敢出军营一步"
    },
    {
        "what": "第二天，朱温指挥各路军队，一齐进攻秦宗权军营，从清晨四时到下午四时，杀敌两万多人"
    },
    {
        "what": "到夜晚收兵，获得数不清的牛马、辎重物品、武器铠甲和俘虏"
    },
    {
        "what": "当夜秦宗权、张日至偷偷逃走，天快亮时追捕他们，追到阳武桥便回来了"
    },
    {
        "what": "   秦宗权在与朱温的几次交战中，都以失败告终"
    },
    {
        "what": "因为自己的兵力是朱温的数倍，却屡屡败给朱温，心中愤怒不已"
    },
    {
        "what": "败退至郑州时，屠杀城内的百姓，掠夺城内的房屋，许久才离开"
    },
    {
        "what": "   接着又把兵力分散在陕、洛、孟、怀、许、汝等州，占据在那里"
    },
    {
        "what": "因为手下的士卒恐惧朱温，以至于朱温率军队到达时，守城的人都弃城逃走"
    },
    {
        "what": "  文德元年（888年）三月三日，唐昭宗即位"
    },
    {
        "what": "   龙纪元年（889年）二月，秦宗权的部下申丛变节，打断秦宗权的双腿，并把他囚禁起来，遣使向朱温报告"
    },
    {
        "what": "朱温当天接受诏令任申丛为淮西留后官"
    },
    {
        "what": "不久，申丛又被部将郭璠杀害"
    },
    {
        "what": "同月，郭璠押解秦宗权前来献给朱温，朱温派人用囚车将秦宗权解押到长安"
    },
    {
        "what": "到达长安后，唐昭宗前往延喜楼接受俘虏，立即在一棵独柳树下面将秦宗权斩首"
    },
    {
        "what": "蔡州平定"
    },
    {
        "what": "唐昭宗诏令增加太朱温邑实封一百户，赐给庄园和住宅各一处"
    },
    {
        "what": "三月，又加封朱温为检校太尉、兼任中书令，进封为东平王，以奖赏平定蔡州的功劳"
    },
    {
        "what": "  朱温在抵御秦宗权时，郓州朱瑄、兖州朱瑾都领兵来救援"
    },
    {
        "what": "到秦宗权被击败，朱温因为朱瑄、朱瑾与自己同姓，又对自己出过力，都送给厚礼让他们回去"
    },
    {
        "what": "朱瑄、朱瑾因为朱温的军士们勇敢强悍，偷偷地在曹州和濮州的边界上悬赏重金布帛来招诱他们，军士们为了财货之利而离开的人很多，朱温立即传送檄文去谴责他们，朱瑄的回话很无礼，朱温与他们的矛盾便因此产生了"
    },
    {
        "what": "  景福元年（892年）二月三日，朱温亲征郓州，先派遣朱友裕在斗门屯驻军队"
    },
    {
        "what": "九日，朱友裕驻扎在衢南，这天晚上，朱瑄率领一万步兵、骑兵在斗门击败朱友裕，朱友裕向南方撤退"
    },
    {
        "what": "十日，朱温于早晨援救斗门，不知道朱友裕已经撤走，先到斗门的人都被郓州兵所杀"
    },
    {
        "what": "朱温追赶郓州兵，没有追上，于是在村落间暂时停驻军队"
    },
    {
        "what": "这时朱瑄还在同州"
    },
    {
        "what": "十二日，朱温率领军队返回郓州，遭到朱瑄部队的攻击，朱温驾马向南奔逃，摆脱了敌军的追击"
    },
    {
        "what": "  晚唐军阀割据形势"
    },
    {
        "what": "乾宁元年（894年）二月，朱温亲自率领大军从郓州东路向北到达鱼山"
    },
    {
        "what": "朱瑄侦察到后，同样领兵直奔鱼山"
    },
    {
        "what": "两军在此地相遇，立即展开激战"
    },
    {
        "what": "朱瑄兵败，被杀死一万多人，残兵拥挤着进入清河城，朱温在鱼山下收聚敌尸筑起高大的坟墓以记战功，驻军几天后返回"
    },
    {
        "what": "  乾宁二年（895年）正月二十九日，朱温派朱友恭率领军队攻伐兖州，挖成堑壕围住兖城"
    },
    {
        "what": "不久，朱瑄从郓州率领步卒骑兵运送支援的粮食想进入兖州，朱友恭埋下伏兵击败了他们，在高吴将他们的军粮全部夺过来，趁机俘虏了蕃将安福顺、安福庆"
    },
    {
        "what": "乾宁二年（895年）十一月，朱瑄派部将贺瑰、柳存以及蕃将何怀宝等一万多人袭击曹州，想解除兖州的围困"
    },
    {
        "what": "朱温闻讯后，从兖州带领军队策马飞奔到钜野南边，击败了他们，活捉贺瑰、柳存、何怀宝及残余三千多人"
    },
    {
        "what": "  乾宁四年（897年）正月，朱温率领洹水的军队大举攻伐郓州"
    },
    {
        "what": "十五日，在济水旁边安营扎寨，庞师古命令诸将撤下各种树木搭起桥梁"
    },
    {
        "what": "十九日夜晚，庞师古率领中军先渡过济水，呐喊声震撼郓城，朱瑄听到后，弃城夜逃"
    },
    {
        "what": "葛从周追到中都北面，抓住了朱瑄和他的妻子儿女献上，立即被诛杀在汴桥下面"
    },
    {
        "what": "郓州平定"
    },
    {
        "what": "二十三日，朱温进入郓城，任命朱友裕为郓州兵马留后"
    },
    {
        "what": "这时朱温听说朱瑾与史俨儿在丰、沛一带搜括军粮，只留下康怀英据守兖州，朱温因而乘胜派遣葛从周带领大军袭击兖州"
    },
    {
        "what": "康怀英听说郓城失守，接着又有葛从周大军来临，就出城投降"
    },
    {
        "what": "朱瑾、史俨儿便逃奔淮南"
    },
    {
        "what": "郓州、兖州平定"
    },
    {
        "what": "以葛存周任兖州留后"
    },
    {
        "what": "  主词条：凤翔之战光化三年（900年）十一月，宦官刘季述等幽禁唐昭宗，立太子李裕为帝"
    },
    {
        "what": "次年初，与朱温关系密切的宰相崔胤与护驾都头孙德昭等杀刘季述，昭宗复位，改年号为天复，进封朱温为东平王"
    },
    {
        "what": "   此后，崔胤想借朱温之手杀宦官，而韩全诲等宦官则以凤翔（今属陕西省）李茂贞、邠宁（今彬县、宁县）王行瑜等为外援"
    },
    {
        "what": "同年十月，崔胤矫诏令朱温带兵赴京师，朱温乘机率兵七万由河中攻取同州、华州（今华县），兵临长安近郊"
    },
    {
        "what": "韩全诲等劫持昭宗到凤翔投靠李茂贞"
    },
    {
        "what": "   朱温追到凤翔城下，要求迎还昭宗"
    },
    {
        "what": "韩全诲矫诏令朱温返镇"
    },
    {
        "what": "天复二年（902年），朱温在一度返回河中之后再次围攻凤翔，多次击败李茂贞"
    },
    {
        "what": "前来救助李茂贞的鄜坊节度使李周彝也被拦截而归降朱温"
    },
    {
        "what": "凤翔镇被围日久，城中食尽，冻饿死者不可胜计"
    },
    {
        "what": "李茂贞被围无奈，于天复三年（903年）正月杀韩全诲等二十人，与朱温议和"
    },
    {
        "what": "朱温挟昭宗回长安，昭宗从此成了他的傀儡"
    },
    {
        "what": "昭宗也深知自己的境遇，他对朱温说：“宗庙社稷是卿再造，朕与戚属是卿再生"
    },
    {
        "what": "”因此他对朱温唯命是从"
    },
    {
        "what": "不久，朱温杀第五可范等宦官七百多人"
    },
    {
        "what": "唐代中期以来长期专权的宦官势力受到了彻底的打击"
    },
    {
        "what": "朱温则被任命为守太尉、兼中书令、宣武等军节度使、诸道兵马副元帅，进爵为梁王，并加赐“回天再造竭忠守正功臣”的荣誉头衔和御制《杨柳词》5首"
    },
    {
        "what": "  主词条：白马驿之祸、朱全忠篡唐建梁之战天佑元年（904年），朱温商议将唐昭宗接到洛阳，担心唐室大臣反对，于是命令养子朱友谅假托昭宗诏令，诛杀了丞相崔胤、京兆尹郑元规等人，再上奏表坚决请求昭宗到洛阳，昭宗不得已听从了"
    },
    {
        "what": "朱温便下令长安百姓按籍迁移，拆毁长安宫室、房屋，将木料顺渭水漂下，在洛阳营建宫室"
    },
    {
        "what": "   唐昭宗到达洛阳时，唐廷的六军侍卫之士，已经散亡殆尽，昭宗身边卫士及宫中之人均为朱温派来的人"
    },
    {
        "what": "从长安至洛阳途中，昭宗身边尚有小黄门及打球、内园小儿二百多人，对于这些人朱温也不放心，命人灌醉后全部坑杀"
    },
    {
        "what": "然后换上年貌、身高相当的二百人顶替，昭宗初不能辨，后来才有所察觉"
    },
    {
        "what": "在这种情况下，昭宗已经成为真正意义上的孤家寡人，随时可能成为朱温的俎上之肉"
    },
    {
        "what": "  梁太祖朱温"
    },
    {
        "what": "朱温强迫昭宗迁都洛阳后，河东李克用、凤翔李茂贞、西川王建、襄阳赵匡凝等地方实力派组成了联盟，以兴复唐室讨伐朱温为名，倡议天下共伐之"
    },
    {
        "what": "朱温决定举兵西讨，又担心昭宗会有所举动，于是决定杀死昭宗，另立新君"
    },
    {
        "what": "天佑元年（904年）八月，他指示左龙武统军朱友恭、右龙武统军氏叔琮及蒋玄晖等人，乘夜暗之际，以入宫奏事为名，率兵进入内宫，杀昭宗后宫河东夫人裴贞一，闯入昭宗所在的何皇后椒兰殿，昭宗身穿单衣绕殿柱而逃，被追上杀死，年仅三十八岁"
    },
    {
        "what": "保护昭宗的昭仪李渐荣也被杀"
    },
    {
        "what": "蒋玄晖本来还要杀何皇后，经其苦苦哀求，才因朱温只下令杀昭宗而免其一死"
    },
    {
        "what": "  唐昭宗死后，朱温立昭宗嫡次子也是第九子李柷为帝，时年十三岁，史称唐哀帝，何皇后则被尊为皇太后"
    },
    {
        "what": "次年，朱温又命蒋玄晖杀死了李裕等昭宗九子"
    },
    {
        "what": "朱温认为唐朝的朝臣中还有不少人忠于李唐皇室，是自己建立新王朝的障碍，必须彻底铲除，才能顺利达到目的"
    },
    {
        "what": "朱温的得力谋士李振，早年屡试进士不中，因而对这些所谓衣冠大族非常痛恨，同时也痛恨科举出身的朝士，也极力主张将这些人全部杀掉"
    },
    {
        "what": "于是朱温在滑州白马驿一举屠杀裴枢为首的朝臣三十多人，李振意犹未尽，对朱温说：“此辈常自称是清流，应当投入黄河，使之变为浊流！”朱温大笑，立即命人把这些尸体投入滚滚黄河"
    },
    {
        "what": "史称这次事变为“白马驿之祸”"
    },
    {
        "what": "唐王朝经此一变，已经完全失去了统治基础，唐哀帝虽仍在位，实际上已经等于亡国"
    },
    {
        "what": "  朱温急于称帝，而十一月，其心腹蒋玄晖、柳璨、太常卿张廷范等认为天下未平，不可太急，朱温不悦，也不接受他们提出的封大国、加九锡、加殊礼这些受禅改朝换代的预备程序，朝廷以朱温为相国、总百揆，以宣武、宣义、天平、护国、天雄、武顺、佑国、河阳、义武、昭义、保义、戎昭、武定、泰宁、平庐、忠武、匡国、镇国、武宁、忠义、荆南等二十一道为魏国，进封朱温为魏王，仍加九锡时，朱温即怒而不受"
    },
    {
        "what": "先前柳璨陷害了太多朝臣，朱温对他也厌恶，十二月，柳璨劝哀帝禅位并奉哀帝命去汴州表达禅位之意，被朱温拒绝"
    },
    {
        "what": "就在柳璨、蒋玄晖等日夜筹谋改朝换代之际，何太后也派宫女向蒋玄晖乞求禅让后放过自己母子"
    },
    {
        "what": "宣徽副使王殷、赵殷衡嫉恨蒋玄晖，趁机诬陷蒋玄晖私通何太后、意图拖延时间等候时机复唐"
    },
    {
        "what": "此时，朱温三次上表辞让魏王、九锡，诏许之，改以为天下兵马元帅，但朱温已将汴州府舍修为宫阙"
    },
    {
        "what": "朱温相信王殷、赵殷衡的说辞，便遣使杀蒋玄晖，密令王殷、赵殷衡去积善宫将何太后缢杀，再贬杀柳璨、张廷范"
    },
    {
        "what": "唐哀帝也被迫下诏称母后之死系私通蒋玄晖事发自杀，追废母后为庶人"
    },
    {
        "what": "新年的祭天也因太后丧及“宫闱丑闻”为由而没有举行"
    },
    {
        "what": "  天祐四年（907年）四月，朱温在表面上由唐宰相张文蔚率百官劝进之后，接受唐哀帝禅位，正式即皇帝位，更名为朱晃，改元开平，国号大梁"
    },
    {
        "what": "升汴州为开封府（今河南开封），建为东都，而以唐东都洛阳为西都"
    },
    {
        "what": "废17岁的唐哀帝为济阴王，迁往曹州济阴囚禁"
    },
    {
        "what": "次年二月，将其杀害"
    },
    {
        "what": "  主词条：潞州之战后梁周边形势"
    },
    {
        "what": "开平元年（907年）五月，因境内的潞州（今山西长治）被李克用占据，而潞州又是进击太原的必要之地，于是朱温任康怀贞为潞州行营招讨使，率领将兵八万攻伐潞州"
    },
    {
        "what": "六月，康怀贞率军抵达潞州，挥动大军昼夜猛攻攻"
    },
    {
        "what": "但苦战多日，依然久攻不下，于是大动土木，环潞州城深挖沟壕，多筑堡垒，使潞州城与外面完全隔绝，准备长期围攻"
    },
    {
        "what": "李克用闻讯立刻率大军救援潞州，几乎调动境内全部兵马"
    },
    {
        "what": "同时又派兵攻打潞州南面的泽州(治今山西省晋城市)，欲切断梁军的退路和军需补给线，朱温派范居实，统兵增援泽州"
    },
    {
        "what": "八月，李克用的援军已经到达，驻扎在离潞州仅二十里的高河镇，不断派出骑兵袭击围城的梁军"
    },
    {
        "what": "朱温则改派李思安取代康怀贞"
    },
    {
        "what": "  开平二年（908年）一月，李克用病逝，其子李存勖继位"
    },
    {
        "what": "朱温先以为这是李克用的诱敌之计"
    },
    {
        "what": "二月，将昭宣帝杀害"
    },
    {
        "what": "于同年三月，亲自来到泽州，开始指挥部队从潞州撤军"
    },
    {
        "what": "后来确定李克用已死无诈，又召回围攻潞州的军队，继续包围潞州"
    },
    {
        "what": "因为李思安久攻潞州不仅没有丝毫建树，反而损失将校四十余人，士卒损失数以万计，于是将李思安召到泽州，革除其全部官爵，另任命刘知俊为潞州行营招讨使"
    },
    {
        "what": "刘知俊率精兵万余进攻，小胜而骄，结果遭到新继位的李存勖偷袭而大败，梁兵伤亡数以万计，至此解了长达一年多的潞州之围"
    },
    {
        "what": "朱温闻讯感叹道：“生子当如李亚子（李存勖小名），李克用虽死犹生！我的儿子与之相比，就像猪狗一样！”开平五年（911年），河北赵王王镕归附李存勖，朱温派遣王景仁征讨，王镕于是请求李存勖援助他"
    },
    {
        "what": "这年冬天，王景仁与李存勖的部队在柏乡相遇，在同李存勖交战中惨败而归"
    },
    {
        "what": "乾化元年（911年）七月，燕王刘守光称帝，李存勖闻讯，前去讨伐，刘守光不敌李存勖，写信请求朱温援助"
    },
    {
        "what": "朱温深知幽燕一旦落入李存勖手中，后果不堪设想，于是决定攻打王镕以此声援刘守光"
    },
    {
        "what": "乾化二年（912年）二月十五日，朱温率军从洛阳出发，号称五十万大军"
    },
    {
        "what": "   二月二十六日，朱温到达魏州（今河北省大名县东北），命杨师厚等围枣强（今枣强县东），贺德伦等围蓨县（今景县）"
    },
    {
        "what": "   杨师厚昼夜急攻，枣强因城小，很快被攻陷"
    },
    {
        "what": "当时蓨县还没有破城，朱温随与杨师厚的部队前去支援贺德伦，将军队驻扎在蓨县以东，可蓨县还未取下，却被数百敌骑攻扰了军营，火烧了很多帐篷和粮草，军心因此大丧"
    },
    {
        "what": "而李存勖的攻势很快，几尽将刘守光消灭，刘守光无法与李存勖继续抗衡下去，朱温“围魏救赵”的方法也失去了作用，随即收拢军队撤退"
    },
    {
        "what": "朱温年老体弱，本来就患病在身，路上的颠簸更加重了他的病情，以至于不能乘坐轿子，一路歇歇停停，五月六日才返回洛阳"
    },
    {
        "what": "  五月十五日，朱温病情越发沉重，对近臣十分悲伤地说道：“我经营天下三十年，想不到太原余孽竟能死灰复燃如此猖狂！我看他李存勖的志向不小，上天却又欲夺我余年，几个儿子皆非其敌手，我将死无葬身之地了”"
    },
    {
        "what": "说着竟哭泣失声，昏死过去了，近臣一面失声呼叫，一面急传御医，待其渐渐苏醒过来，御医也火速来到，急忙诊脉用药，病情这才稍稍缓解"
    },
    {
        "what": "  因为朱温长子郴王朱友裕早死，因此从建国称帝以来，朱温始终未立太子"
    },
    {
        "what": "此时他明白自己命不久矣，而其他几个亲子又不堪重用，仅仅养子博王朱友文尚可成气，因而决定传位于他"
    },
    {
        "what": "  朱友文驻守在东都开封，朱温于是将传国玉玺交给其妻王氏，让她去召回朱友文，事情被郢王朱友珪的妻子张氏探知，告于朱友珪，朱友珪这时是控鹤都指挥使，控鹤都负责皇宫的警卫工作"
    },
    {
        "what": "   朱温看出朱友珪有野心，又下诏即将朱友珪调任为莱州刺史，朱友珪知道这是为了传位给朱友文做的准备，如若自己起身赴命，那么从此就与皇帝宝座无缘，而且当时大多被贬到地方的人，紧接着就追命赐死，恐有杀身之祸，朱友珪更不能自安"
    },
    {
        "what": "   乾化二年（912年）六月二十二日，朱友珪穿上庶装，装扮成庶人进入左龙虎军，把情况向统军韩勍说明，韩勍是朱友珪的老部下，恐发生变故因此受到波及不能自保，于是与朱友珪一拍即合，决定协助他弑父篡位"
    },
    {
        "what": "   韩勍带领着自己信任的亲兵五百人，换上控鹤军士的服装，跟随朱友珪混入皇宫中隐蔽起来，至半夜启动，砍断万春门的门闩涌入朱温所在的寝殿，此时宫人因恐惧而呼号奔走地逃逸了"
    },
    {
        "what": "   朱温从床上惊醒坐起，问：“造反的人是谁”朱友珪走入回答：“不是别人，是我！”朱温对着朱友珪说：“我早怀疑此贼，愤恨没有杀之"
    },
    {
        "what": "你如此悖逆，杀父篡位，老天爷会放过你吗？”朱友珪指示自己的马夫冯廷谔说“将老贼万段”冯廷谔提刀追砍，朱温奋起，绕着大殿内的柱子躲避，期间冯廷谔挥刀三次都劈到了大柱子上，最后朱温力乏，倒于床榻，冯廷谔找准机会向朱温的腹部刺了一刀，刀刃从后背穿透出来，朱温随即毙命"
    },
    {
        "what": "   朱温被杀死之后，朱友珪使人将寝宫地砖扒开，挖一个坑，用蚊帐包裹其尸，然后埋入寝宫地下，即派供奉官丁昭溥策马飞奔传要将朱友文赐死的伪诏，   并于清晨呼使文武百官集中在大殿上，宣读伪造的皇帝诏书“博王朱友文谋图造反，指示杀驾，昨日夜，有穿盔带甲的兵士突入皇宫，幸好依赖于郢王友珪的忠孝，亲率控鹤军士将其歼殄，保全了朕的性命"
    },
    {
        "what": "然朕之病情也因为昨晚发生的事情而更加严重了，故此现以郢王友珪监国，主持军国大事"
    },
    {
        "what": "”  六月二十六日，丁昭溥返回，朱友珪确认朱友文已死，公开了朱温驾崩的消息，而后又公布假遗命制书，宣布继帝位，   定明年的年号为“凤历”给朱温上谥号神武元圣孝皇帝，庙号太祖，陵墓叫宣陵，   于十一月二十五日在伊阙下葬"
    },
    {
        "what": "   朱友珪加冕登基，可朝中人人都清楚他弑父篡位的事实，即使朱友珪用财宝贿赂，大多也不情愿辅佐他，君臣因此离心离德"
    },
    {
        "what": "   又因朱友珪软弱失策，对在外的藩王们没有采取先发制人，导致均王朱友贞借此机会，暗中纠集了其他藩王和旧将帅们为外应，确保有与朱友珪进行长期军事对抗的实力，并策动统领洛阳禁军的袁象先为内应，约定发动宫廷政变"
    },
    {
        "what": "朱友贞先于凤历元年（913年）一月，起兵讨伐朱友珪，朱友珪派出拦截迎战的部队首战不力，接着被朱友贞劝降，继而又策反了开封龙骧军众将，因此朱友贞于二月顺利进入东都开封"
    },
    {
        "what": "之后袁象先在西都洛阳向朱友珪发难，率兵几千冲入皇宫中，朱友珪闻讯兵变，同皇后李氏及冯廷谔逃命，来到宫楼北垣楼下，将要出去，可朱友珪知道自己总还是不能逃脱，就让冯廷谔将自己与皇后张氏杀死，紧接着冯廷谔也自尽了"
    },
    {
        "what": "   朱友珪死后，袁象先携传国玉玺至东都开封，朱友贞等来玉玺就在开封即位，追废朱友珪为庶人，除朱友珪的年号，复称乾化（913年）三年"
    },
    {
        "what": "  朱温特别珍爱人才，而且他这种求贤若渴的心态非常急切"
    },
    {
        "what": "刚刚接受唐帝的禅让，朱温就立刻遣官臣去民间搜寻贤良之人，特别针对身居下位有能力但没地方施展的人才，如有找到，朱温往往都特加擢拔任用"
    },
    {
        "what": "对于那些知晓朝廷政策弊病的人所上表的奏章，朱温也大都亲自翻阅，选择一些有利的建议施行"
    },
    {
        "what": "对于权豪横行的现象，朱温也进行压制"
    },
    {
        "what": "比如朱温的爱将寇彦卿一次上朝时，途中有人未来得及避让，被他的随从打死，朱温因此严惩了寇彦卿，没有因为寇彦卿功臣的身份而袒护他"
    },
    {
        "what": "  朱温在称帝前，就确立了严格的军法，如果将校有阵亡的，他部队所属的士卒也要全部斩首，称之为“跋队斩”"
    },
    {
        "what": "因此士卒常因为所属部队的主将死亡而逃跑，不敢归队"
    },
    {
        "what": "朱温于是命令军士全都在面部刺字来记录所在军号，这样逃跑的人大多被关口津渡的人认出而抓住送回所属"
    },
    {
        "what": "所以，逃亡者都聚集在山林川泽之中做强盗，成为州和县的大害"
    },
    {
        "what": "朱温称帝之后，随即废除这套军法，并且颁诏令赦免这些人的罪过，从今以后即使脸部刺字也听任回乡里"
    },
    {
        "what": "所以那些迫不得已为盗的人，大都散伙回家，使强盗减少了十之七八"
    },
    {
        "what": "  对于处理军队和地方的关系，朱温也有一套行之有效的方法"
    },
    {
        "what": "为了保证地方行政的顺利，朱温给手下将领下达了命令：不论军阶多高，有多少人马，在政务方面，一律听从地方官员管理和安排"
    },
    {
        "what": "有了朱温的“最高命令”，地方官员和军队将领发生纷争的概率，减小了许多"
    },
    {
        "what": "这样一来，权责分明，自然有利于国家的安定团结"
    },
    {
        "what": "由于常年的战乱造成大批青壮年劳动力的损失，百姓为躲避战乱以及繁重的赋税徭役，纷纷流离失所，导致大量的农田荒芜，对农业生产产生极为严重的影响"
    },
    {
        "what": "朱温建国之后，狠抓农业生产，奖励农耕，减轻租赋，将耕牛租借给没有耕牛的农民以供生产"
    },
    {
        "what": "这一系列的宽容政策，使之成为梁数十年征战的经济支柱"
    },
    {
        "what": "  刘崇之母：朱三非常人也，汝曹善遇之"
    },
    {
        "what": "  李克用：全忠妒功疾能，阴狡祸贼，异日必为国患"
    },
    {
        "what": "  《新五代史》：呜呼，天下之恶梁久矣！自后唐以来，皆以为伪也"
    },
    {
        "what": "至予论次五代，独不伪梁，而议者或讥予大失《春秋》之旨，以谓“梁负大恶，当加诛绝，而反进之，是奖篡也，非《春秋》之志也"
    },
    {
        "what": "”  何去非：“梁祖起于宛朐群盗之党，已而挟听命之唐，鞭笞天下，以收神器，亦可谓一时之奸雄"
    },
    {
        "what": "然及其衰暮，而河、汾李氏基业已大，固当气吞而志灭之矣"
    },
    {
        "what": "借使不遂及于子祸，则其后嗣有足以为庄宗之抗哉？此梁之亡不待旋踵也"
    },
    {
        "what": "”  马端临：及朱温举兵内向，尽夷中人，废神策，而唐之鼎祚移於内"
    },
    {
        "what": "  梁克家：朱温以斗筲、穿窬之才，谈笑而攘神器，士大夫亦欣然与之，莫敢正议"
    },
    {
        "what": "  洪迈：“朱梁之恶，最为欧阳公《五代史记》所斥詈"
    },
    {
        "what": "然轻赋一事，旧史取之，而新书不为拈出"
    },
    {
        "what": "其语云：‘梁祖之开国也，属黄巢大乱之余，以夷门一镇，外严烽候，内辟污莱，厉以耕桑，薄其租赋，士虽苦战，民则乐输，二纪之间，俄成霸业"
    },
    {
        "what": "及末帝与庄宗对垒于河上，河南之民，虽困于辇运，亦未至流亡"
    },
    {
        "what": "其义无他，盖赋敛轻而丘园可恋故也"
    },
    {
        "what": "及庄宗平定梁室，任吏人孔谦为租庸使，峻法以剥下，厚敛以奉上，民产虽竭，军食尚亏，加之以兵革，因之以饥馑，不四三年，以致颠陨"
    },
    {
        "what": "其义无他，盖赋役重而寰区失望故也"
    },
    {
        "what": "’予以事考之，此论诚然，有国有家者之龟鉴也"
    },
    {
        "what": "”王夫之：①曹操师之以杀孔融、夺汉室；朱温师之以歼清流、移唐祚；流波曼衍，小人以之乱国是而祸延宗社"
    },
    {
        "what": "   ②朱温起于群盗，凶狡如蛇虺，无尺寸之功于唐，而夺其三百年磐石之社稷"
    },
    {
        "what": "  方浚师：他若曹丕之收父妾，朱温之奸子妇；北魏张祚，其叔母马氏及姑姊妹，兄弟之子皆淫之"
    },
    {
        "what": "蒙逊子牧犍淫其嫂李氏，兄弟三人传嬖之"
    },
    {
        "what": "呜呼！人之异于禽兽者几希"
    },
    {
        "what": "  吕思勉：梁太祖的私德，是有些缺点的，所以从前的史家，对他的批评，多不大好"
    },
    {
        "what": "然而私德只是私德，社会的情形复杂了，论人的标准，自亦随之而复杂，政治和道德、伦理，岂能并为一谈？就篡弑，也是历代英雄的公罪，岂能偏责一人？老实说：当大局阽危之际，只要能保护国家、抗御外族、拯救人民的，就是有功的政治家"
    },
    {
        "what": "   　当一个政治家要尽他为国为民的责任，而前代的皇室成为其障碍物时，岂能守小信而忘大义？在唐、五代之际，梁太祖确是能定乱和恤民的，而历来论者，多视为罪大恶极，甚有反偏袒后唐的，那就未免不知民族的大义了"
    },
    {
        "what": "惜乎天不假年，梁太祖篡位后仅6年而遇弑"
    },
    {
        "what": "末帝定乱自立，柔懦无能，而李克用死后，其子存勖袭位，颇有英锐之气"
    },
    {
        "what": "毛泽东：朱温处四战之地，与曹操略同，而狡猾过之"
    },
    {
        "what": "  白寿彝：朱温的滥杀是历史上罕见的"
    },
    {
        "what": "朱温的荒淫，行同禽兽，即使在封建帝王中也罕有其匹"
    },
    {
        "what": "  《剑桥中国隋唐史》：他的成功在很大程度上是由于善于作战和有决心，他也以此训练和造就了他的强有力的军队"
    },
    {
        "what": "但也应该提到，他的成功还大大地归因于他的残酷无情和诡计多端，而这一点甚至在那个野蛮的时代也是数一不二的"
    },
    {
        "what": "  梅毅：后梁的朱温，残暴不仁，儿孙不肖，又喜欢与儿媳通奸"
    },
    {
        "what": "给自己儿子戴绿帽子，朱三真乃古今一大忍人、恶人"
    },
    {
        "what": "  传说朱温出生的那天晚上，天显异象，“所居庐舍之上，赤气上腾”，很远的地方就能看到一片红光"
    },
    {
        "what": "邻居都以为朱家失火了，纷纷提着水桶，端着脸盆，赶到朱家救火"
    },
    {
        "what": "谁知跑到朱家门口一看，一切平静如常，什么事情也没有发生"
    },
    {
        "what": "  朱温曾经和自己的幕僚及游客坐在大柳下，朱温自言自语地说：“这棵树应该做车毂"
    },
    {
        "what": "”大家都不做声"
    },
    {
        "what": "有几个游客起身回答说：“应该做车毂"
    },
    {
        "what": "”朱温勃然大怒，大声说：“书生们喜欢顺口玩弄别人，你们都是这一类的人！车毂必须用榆木制作，柳木岂能做！”他便对左右的人说：“还等什么！”左右数十人，拉出说“适宜做车毂”的门客全部打死"
    },
    {
        "what": "  皇后张惠对朱温所起的作用是很大的"
    },
    {
        "what": "张惠既有温柔的一面，又有英武的一面"
    },
    {
        "what": "不但内事做主，外事包括作战也常让朱温心服口服"
    },
    {
        "what": "有时候朱温已率兵出征，中途却被张惠派的使者赶上，说是奉张夫人之命，战局不利，请他速领兵回营，朱温就立即下令收兵返回"
    },
    {
        "what": "这必然影响到内部的团结和战斗力，张惠对此也很明了，就尽最大努力来约束朱温的行为，使朱温集团内部尽可能少地内耗，一致对外"
    },
    {
        "what": "张惠和朱温共同生活了二十余年，在朱温灭唐建后梁前夕却染病去世"
    },
    {
        "what": "朱温得到张惠病重的消息，急忙赶了回来"
    },
    {
        "what": "临终前，张惠还对朱温劝道：“既然你有这种建霸业的大志，我也没法阻止你了"
    },
    {
        "what": "但是上台容易下台难，你还是应该三思而后行"
    },
    {
        "what": "如果真能登基实现大志，我最后还有一言，请你记下"
    },
    {
        "what": "“朱温忙说：“有什么尽管说，我一定听从"
    },
    {
        "what": "“张惠缓缓说道：“你英武超群，别的事我都放心，但有时冤杀部下、贪恋酒色让人时常担心"
    },
    {
        "what": "所以'戒杀远色'这四个字，千万要记住！如果你答应，那我也就放心去了"
    },
    {
        "what": "“张惠死后，不仅朱温难过流泪，就连众多将士也是悲伤不已"
    },
    {
        "what": "朱温为黄巢同州刺史时，娶砀山富室女张氏为妻"
    },
    {
        "what": "张氏贤明有礼，朱温对她礼遇有加，每次遇到军国大事，都必须与张氏进行商议，然后才出兵   "
    },
    {
        "what": "天祐元年（904年）张氏病死后，朱温开始纵情于声色，朱温诸子常年在外统兵，朱温常常召自己的儿媳们入宫，与之私通   "
    },
    {
        "what": "乾化二年（912年），朱温兵败蓨县，在行军途中得病，回到洛阳，在张全义家的会节园避暑，逗留了数日，张全义的妻女都被朱温所奸淫   "
    },
    {
        "what": "张全义之子愤极要手刃朱温，为张全义苦苦劝止"
    },
    {
        "what": "至于朱温的儿子们对朱温的乱伦，不仅毫无羞耻，竟然利用妻子争宠，博取欢心，争夺储位，真是旷古丑闻！养子朱友文的妻子王氏长相很美，朱温尤其宠爱她，并时常想以朱友文为太子   "
    },
    {
        "what": "更让人吃惊的是，朱温的儿子们对父亲的乱伦行为不但不愤恨，反而不知廉耻地利用妻子在父亲床前争宠，千方百计地讨好朱温，博取欢心，以求将来能继承皇位"
    },
    {
        "what": "  父亲：朱诚，朱温称帝追尊为梁烈祖"
    },
    {
        "what": "母亲：王氏，朱温称帝追尊为文惠皇后"
    },
    {
        "what": "  朱全昱（长兄），唐朝安南节度使，同平章事，太师"
    },
    {
        "what": "朱温建梁，封为广王，宋州节度使"
    },
    {
        "what": "赠尚书令，谥广德靖王"
    },
    {
        "what": "朱存（次兄），朱温建梁，追封为朗王"
    },
    {
        "what": "张惠，张惠没有活至朱温称帝之时，生前为魏国夫人"
    },
    {
        "what": "朱温追封张惠为贤妃，朱友贞追封为元贞皇太后"
    },
    {
        "what": "石氏，武威郡君，石彦辞妹"
    },
    {
        "what": "陈昭仪"
    },
    {
        "what": "李昭容"
    },
    {
        "what": "段美人，段凝妹"
    },
    {
        "what": "某氏，朱瑾妻"
    },
    {
        "what": "亲子朱友裕，唐朝华州节度使，检校太保，行营都统"
    },
    {
        "what": "朱温建梁，追封为郴王，赠太师"
    },
    {
        "what": "朱友珪，郢王，左右控鹤都指挥使"
    },
    {
        "what": "朱温病重时弑父自立"
    },
    {
        "what": "朱友璋，福王，郓州留后"
    },
    {
        "what": "朱友雍，贺王"
    },
    {
        "what": "朱友徽，建王"
    },
    {
        "what": "朱友孜，康王"
    },
    {
        "what": "朱友贞，均王，东京留守，开封府尹"
    },
    {
        "what": "朱友珪弑父后，均王朱友贞联合将领发动政变，废杀朱友珪，自立为帝，即为后梁末代皇帝"
    },
    {
        "what": "义子朱友文，博王，东京留守"
    },
    {
        "what": "原名康勤"
    },
    {
        "what": "朱友谦，冀王，河中护国节度使"
    },
    {
        "what": "原名朱简"
    },
    {
        "what": "（此人后为李存勖义子）朱友恭，唐朝左龙虎统军"
    },
    {
        "what": "原名李彦威"
    },
    {
        "what": "朱友让，原名李让"
    },
    {
        "what": "朱汉宾，军校朱元礼之子"
    },
    {
        "what": "朱氏，安阳公主，下嫁邺王罗绍威之子罗廷规"
    },
    {
        "what": "朱氏，长乐公主，下嫁颍川县伯赵犨之子赵岩"
    },
    {
        "what": "朱氏，金华公主，下嫁邺王罗绍威之子罗廷规"
    },
    {
        "what": "（继室）朱氏，普宁公主，下嫁赵王王镕之子王昭祚"
    },
    {
        "what": "朱氏，真宁公主"
    },
    {
        "what": "参考资料（    ）朱温的滥杀是历史上罕见的"
    },
    {
        "what": "其一是滥杀战俘"
    },
    {
        "what": "例如唐乾宁二年（895年）十一月，朱温在钜野（今山东巨野）之南大败朱瑄部一万余人，杀戮将尽，俘虏3000余人"
    },
    {
        "what": "傍晚打扫战场时，忽然狂风暴起，沙尘沸涌"
    },
    {
        "what": "朱温竟借故胡说：“这是因为杀的人还不够！”   下令把俘虏全部杀死"
    },
    {
        "what": "又如天复三年（903年）五月，朱友宁攻青州博昌县（今博兴）月余未下，朱温大怒，派遣刘捍督战"
    },
    {
        "what": "朱友宁俘获的十余万民众，让他们背着木石，牵着牛驴，在城南推积土山"
    },
    {
        "what": "朱温到了之后，令人畜一起把木石运送到土山上，冤枉之声，十里之外都能听见"
    },
    {
        "what": "城陷之后，还把城中的民户全部屠尽，尸体放入清河，都被阻塞   "
    },
    {
        "what": "其二是滥杀部属"
    },
    {
        "what": "朱温用法严峻残酷，战场上将校战死，所部士兵生还即全部斩首，叫做“跋队斩”"
    },
    {
        "what": "   他用这种野蛮的办法来提高战斗力，因此一旦主将战死，士兵也就亡逸不敢归"
    },
    {
        "what": "朱温就命军士都文刺其面以记军号，军士或思乡里逃去，关津辄执之送所属，无不死者"
    },
    {
        "what": "其三是滥杀士人"
    },
    {
        "what": "  主词条：梁宣陵宣陵"
    },
    {
        "what": "后梁宣陵位于伊川县城东10公里的常岭村北的高台地上"
    },
    {
        "what": "南为常岭村，北为郑潼路，东为沟丘岭"
    },
    {
        "what": "西为常岭村南北路"
    },
    {
        "what": "史载，后梁灭亡后，李存勖曾派兵发掘宣陵，掠夺陵中的珍宝，宣陵遭到了极大的破坏，后来，十年浩劫时期，宣陵继续遭到破坏，石刻被砸，宣陵坟冢南侧大部分被挖"
    },
    {
        "what": "《旧五代史·卷一·太祖第一》至《旧五代史·卷七·太祖第七》   《新五代史·卷一 梁本纪第一》  《资治通鉴·卷二百五十四》  《资治通鉴·卷二百五十五》  1970年电影《十三太保》：陈星饰演朱温1982年电视剧《十三太保》：刘兆铭饰演朱温2020年电视剧《狼殿下》：丁勇岱饰演朱温（剧中名为楚馗）"
    }
].filter((c) => !!c.start).map((c) => ({ ...c, start: c.start ? d(c.start) : '' }));

export default timeline1;
